In [1]:
import pandas as pd

In [2]:
fruits = pd.Series(["apple", "pear", "orange", "melon", "kiwi"])
fruits

0     apple
1      pear
2    orange
3     melon
4      kiwi
dtype: object

In [3]:
numbers = pd.Series([5, 6, 3])
numbers * 2 + 1

0    11
1    13
2     7
dtype: int64

In [4]:
mask = numbers >= 5
type(mask)

pandas.core.series.Series

In [5]:
numbers[pd.Series([True, True, False])]

0    5
1    6
dtype: int64

In [6]:
data = {
    "Name": ["Anders", "Tomas", "Mario"],
    "Age": [42, 46, 36]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1   Tomas   46
2   Mario   36

In [7]:

data = [
    {"Name": "Anders", "Age": 42},
    {"Name": "Tomas", "Age": 46},
    {"Name": "Mario", "Age": 36}
]

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1   Tomas   46
2   Mario   36

In [8]:
df["Name"]

0    Anders
1     Tomas
2     Mario
Name: Name, dtype: object

In [9]:
df["Age"] = df["Age"] + 1
df

     Name  Age
0  Anders   43
1   Tomas   47
2   Mario   37

In [10]:
df["Age"] >= 50

0    False
1    False
2    False
Name: Age, dtype: bool

In [11]:
df[df["Age"] >= 50]

Empty DataFrame
Columns: [Name, Age]
Index: []

In [12]:
str(df)

'     Name  Age\n0  Anders   43\n1   Tomas   47\n2   Mario   37'

In [13]:
print(df)

     Name  Age
0  Anders   43
1   Tomas   47
2   Mario   37